# オリジナルプロダクト開発における概要と要件について

<!-- 仮プロダクト名: JunkMailJudo -->

<ol>

## <li>誰のどんな課題を解決するのか？</li>

  - 企業や組織の公開メールアドレスを管理する担当者の課題を解決します。
  - メールの分類や仕分けが提供側で行われ、必要なメールが迷惑メールとして分類される可能性があり、結果として迷惑メールを確認する手間が増えるというものです。

## <li>なぜそれを解決したいのか？</li>

  - メールの管理作業が効率化され、不要なメールが混入することを防ぎ、必要なメールが迷惑メールとして分類されるリスクを減らすためです。
  - 企業や組織の公開メールアドレスを管理する担当者の作業負荷が軽減され、ビジネスの効率化に貢献します。
  - また、操作性、わかりやすさを重視し、PCに疎い人にも使いこなせるようにします。


## <li>どうやって解決するのか？</li>

  - メールの仕分けについてローカル環境で動作する物を作成する予定です。
  - 社内の他のメンバーが作成したフィルタリングアルゴリズムを利用でき、自分で全てを作成する必要がなくなります。
  - また、最小構成としてはメールを正規表現でフィルタリングする機能を実装し、メーラーソフト(OutLook)との連携を試みます。

## <li>プロダクト概要</li>

本プロダクトは、企業や組織の公開メールアドレスに対して届く迷惑メールをローカル環境で仕分けるためのアプリケーションです。既存のメールサービスではメールの分類・仕分けが提供側で行われ、個々の利用者の取捨選択が制限されています。また、その分類方法がブラックボックス化されているため、必要なメールが分類される可能性があり、そのために迷惑メールを確認する手間が増えています。この問題を解決するために本プロダクトを提案します。

## <li>プロダクトの主な使用者</li>

本アプリケーションの主な使用者は、企業や組織の公開メールアドレスに対して何らかのアクションを取る業務を担当している方々です。

## <li>既存サービスの問題点</li>

- メールの仕分けや分類がサービス提供者側で行われ、個々の利用者の取捨選択が制限されている
- メールの分類方法がブラックボックス化されており、必要なメールが分類される可能性を払拭できない
- 迷惑メールのフィルタリングが緩いと、不要なメールが混入する
- 根本的にはメールサービスの提供者側に依存している

## <li>本プロダクトの差別化</li>

- ローカル環境でのメールの仕分け: 個々の利用者が直接コントロールでき、自身のニーズに合わせた仕分けを可能にする
- シンプルなフィルタリングアルゴリズム: ユーザー自身が設定をカスタマイズし、個々人にマッチした仕分けが可能になります
- 社内共有の利用: 社内の他のメンバーが作成したフィルタリングアルゴリズムを利用でき、自分で全てを作成する必要がなくなります

## <li>実装手順の計画</li>

### 最小構成

  メールを正規表現でフィルタリングできる事を着地点とし、POP3のみの対応になる事を許容します。

  使用されているメーラーソフト(OutLook)との連帯により実装ができる場合、最優先でこの手段を採用します。
  
  上記手段が難しいと判断した場合、
  

<!-- ## <li>抽象的な要件</li> -->

<!-- ## <li>非機能要件</li> -->

<!-- ## <li>機能要件</li> -->

## <li>実行可否に関する所感等</li>

### 開発の実行価値

- 本プロダクトは実際のビジネスシーンでの課題解決を目指しています。
- 要件を満たすことで、実際の業務で使用される可能性が非常に高いです。

### 懸念

- メールサーバーとの連帯が絡むので、プロダクトをプレゼンする際は、実際の再現環境まで構築する必要があります。
- 付随する機能の部分でWEB開発に絡める事はできると考えますが、根本はそれに当たらない可能性があります。
- 本質的な問題解決がローカルで行われる為、共有する仕組み等まで構築しなければデータベースが必要になりません。


</ol>
